In [12]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [2]:
%sql mysql+mysqlconnector://root:root@localhost/mydb

In [3]:
%%sql
show tables

 * mysql+mysqlconnector://root:***@localhost/mydb
20 rows affected.

[('contractors',),
 ('customerdata',),
 ('customers',),
 ('customersdetails',),
 ('customertransactions',),
 ('drivers',),
 ('employee',),
 ('employee1',),
 ('employee_basic_view',),
 ('employees',),
 ('events',),
 ('high_employee_details',),
 ('high_paid_employees',),
 ('orders',),
 ('rides',),
 ('rides1',),
 ('rides2',),
 ('sales',),
 ('sensor_data',),
 ('users',)]

In [11]:
%%sql
drop table if exists sales;
CREATE TABLE sales (
    TransactionID INT PRIMARY KEY,
    Store VARCHAR(10),
    SalesAmount DECIMAL(10,2)
);
INSERT INTO sales VALUES
(1, 'A', 100.00),
(2, 'A', 200.00),
(3, 'A', 150.00),
(4, 'B', 250.00),
(5, 'B', 300.00);

 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.
0 rows affected.
5 rows affected.

[]

In [13]:
%%sql
select * from sales;

 * mysql+mysqlconnector://root:***@localhost/mydb
   mysql+mysqlconnector://root:***@localhost/uber
5 rows affected.

[(1, 'A', Decimal('100.00')),
 (2, 'A', Decimal('200.00')),
 (3, 'A', Decimal('150.00')),
 (4, 'B', Decimal('250.00')),
 (5, 'B', Decimal('300.00'))]

In [14]:
%%sql
Select store,sum(SalesAmount) as totalsales from sales
group by store -- THIS IS A NORMAL AGGERGATE FUNCTION
-- IF I NEED THE TRANSACTIONID ALSO TO BE SHOWN IN THIS YOU CANNOT ABLE TO DO THAT ERROR WILL OCCUR, SO WE USE WINDOW FUNCTION IN MANY PLACES

 * mysql+mysqlconnector://root:***@localhost/mydb
   mysql+mysqlconnector://root:***@localhost/uber
2 rows affected.

[('A', Decimal('450.00')), ('B', Decimal('550.00'))]

In [25]:
%%sql
Select 
TransactionID,
Store,
SalesAmount ,
sum(salesamount) over (partition by store ) as Totalsales from sales;

 * mysql+mysqlconnector://root:***@localhost/mydb
   mysql+mysqlconnector://root:***@localhost/uber
5 rows affected.

[(1, 'A', Decimal('100.00'), Decimal('450.00')),
 (2, 'A', Decimal('200.00'), Decimal('450.00')),
 (3, 'A', Decimal('150.00'), Decimal('450.00')),
 (4, 'B', Decimal('250.00'), Decimal('550.00')),
 (5, 'B', Decimal('300.00'), Decimal('550.00'))]

In [18]:
%%sql
SELECT 
    TransactionID,
    Store,
    SalesAmount,
    SUM(SalesAmount) OVER (PARTITION BY Store ORDER BY TransactionID) AS RunningTotal
FROM sales;

 * mysql+mysqlconnector://root:***@localhost/mydb
   mysql+mysqlconnector://root:***@localhost/uber
5 rows affected.

[(1, 'A', Decimal('100.00'), Decimal('100.00')),
 (2, 'A', Decimal('200.00'), Decimal('300.00')),
 (3, 'A', Decimal('150.00'), Decimal('450.00')),
 (4, 'B', Decimal('250.00'), Decimal('250.00')),
 (5, 'B', Decimal('300.00'), Decimal('550.00'))]

In [29]:
%%sql
Select 
*,
avg(salesamount) over (partition by store ) as Totalsales from sales;

 * mysql+mysqlconnector://root:***@localhost/mydb
   mysql+mysqlconnector://root:***@localhost/uber
5 rows affected.

[(1, 'A', Decimal('100.00'), Decimal('150.000000')),
 (2, 'A', Decimal('200.00'), Decimal('150.000000')),
 (3, 'A', Decimal('150.00'), Decimal('150.000000')),
 (4, 'B', Decimal('250.00'), Decimal('275.000000')),
 (5, 'B', Decimal('300.00'), Decimal('275.000000'))]

In [41]:
%%sql
DROP TABLE IF EXISTS Employees;
CREATE TABLE Employees (
    EmployeeID INT,
    Name VARCHAR(50),
    Department VARCHAR(50),
    HireDate DATE
);

INSERT INTO Employees VALUES
(1, 'Alice',   'HR',      '2020-05-01'),
(1, 'Alice',   'HR',      '2022-06-15'),
(2, 'Bob',     'IT',      '2021-07-10'),
(3, 'Charlie', 'Finance', '2020-09-30'),
(3, 'Charlie', 'Finance', '2022-05-22');

 * mysql+mysqlconnector://root:***@localhost/mydb
   mysql+mysqlconnector://root:***@localhost/uber
0 rows affected.
0 rows affected.
5 rows affected.

[]

In [42]:
%%sql
WITH EmployeeRank AS (
    SELECT EmployeeID,
           Name,
           Department,
           HireDate,
           ROW_NUMBER() OVER (PARTITION BY EmployeeID ORDER BY HireDate ASC) AS rownum
    FROM employees
)
SELECT EmployeeID,
       Name,
       Department,
       HireDate
FROM EmployeeRank
WHERE rownum = 1;

 * mysql+mysqlconnector://root:***@localhost/mydb
   mysql+mysqlconnector://root:***@localhost/uber
3 rows affected.

[(1, 'Alice', 'HR', datetime.date(2020, 5, 1)),
 (2, 'Bob', 'IT', datetime.date(2021, 7, 10)),
 (3, 'Charlie', 'Finance', datetime.date(2020, 9, 30))]

In [47]:
%%sql
-- Creating a temporary named result set using WITH (Common Table Expression - CTE)
WITH EmployeeRank AS (
    
    -- Inside the CTE we calculate row numbers for each employee
SELECT 
EmployeeID,Name,Department,HireDate,  ROW_NUMBER() OVER (PARTITION BY EmployeeID ORDER BY HireDate ASC) AS rownum
FROM employees
)
        
        -- ROW_NUMBER assigns ranking per EmployeeID, based on HireDate
        -- PARTITION BY EmployeeID means ranking restarts for each employee
        -- ORDER BY HireDate ASC means earliest joining date gets rank 1
      

-- Outside the CTE we select only the earliest record per employee
-- rownum = 1 means first hired date record for each employee
SELECT 
    EmployeeID,
    Name,
    Department,
    HireDate
FROM EmployeeRank
WHERE rownum = 1;

 * mysql+mysqlconnector://root:***@localhost/mydb
   mysql+mysqlconnector://root:***@localhost/uber
3 rows affected.

[(1, 'Alice', 'HR', datetime.date(2020, 5, 1)),
 (2, 'Bob', 'IT', datetime.date(2021, 7, 10)),
 (3, 'Charlie', 'Finance', datetime.date(2020, 9, 30))]